<template>
  <v-card outlined>
    <v-card-title>捐赠 & 说明</v-card-title>
    <v-card-text>
      <a target="_blank" href="https://api.xhboke.com/doc/#问题提交-捐赠打赏">
        捐赠二维码
      </a>
      <p>
        本程序数据来源于【豆瓣电影】...如果侵犯了您的权益，请通知我们，我们会及时删除侵权内容，谢谢合作！
      </p>
    </v-card-text>

    <v-card-title>联系方式</v-card-title>
    <v-card-text>
      <a href="mailto:xhapame@gmail.com" target="_blank">xhapame@gmail.com</a>
    </v-card-text>

    <v-card-title>更新历史</v-card-title>
    <v-card-text>
      <h3>### 【1.1.4 - 1.1.5】2020/11/15</h3>
      <p></p>
      <p>1. 增加全局变量，使更具有普遍化和修改简易化</p>
      <p>2. 新增对bartitle的修改，对于Safari用户进入播放页面也能知道播放的视频名称</p>
      <p>3. 新增icon图标的显示</p>
      <p>4. 新增豆瓣top250中的一部分显示</p>
      <p>5. 修复404页面点击返回首页按钮失效</p>
      <p>6. 播放播放页面标签修改为手机电脑页面同步显示，且更加多样化</p>
      <p>7. 删除播放页面标签的图标，占用页面空间且可能导致显示不全</p>
      <p>8. Toolbar取消卡片造成的四角缺失</p>
      <h3>### 【1.1.6】2020/11/20</h3>
      <p>1. 添加禁止页面缩放代码</p>
      <p>2. 新增More界面，多个分类，更多的影片呈现</p>
      <p>3. 增添提示性信息</p>
      <h3>### 【1.1.7】2020/11/27</h3>
      <p>1. 新增影人详情页面</p>
      <h3>### 【1.2.0】2021/2/15</h3>
      <p>1. 【后端】API完善并重构</p>
      <p>2. 【前端】主题颜色独立控制</p>
      <p>3. 【后端】删除无播放来源影片，取消从资源网获取播放来源导致问题</p>
      <p>4. 【前端】修改卡片上文字的边距及部分样式</p>
      <h3>### 【1.2.1】2021/2/20</h3>
      <p>1. 【前端】完善影片参演人员信息的展示</p>
      <p>2. 【前端】增加影片"更多信息"</p>
      <p>3. 【前端】增添切换剧集，显示正在播放的剧集</p>
      <p>4. 【后端】修复切换播放来源时，顺序的问题</p>
      <p>5. 【前端】修复短评最上面多出的分界线</p>
      <h3>### 【1.2.2】2021/2/22</h3>
      <p>1. 【后端】修复1.2.0从资源网获取播放来源</p>
      <p>2. 【前端】修复1.2.1更换剧集时导致播放来源改变</p>
      <h3>### 【1.2.3】2021/2/25</h3>
      <p>1. 【前端】修改Footer、404样式</p>
      <p>2. 【前端】将豆瓣TOP250融入系列影片</p>
      <h3>### 【1.3.0】2021/3/19</h3>
      <p>1. 【后端】增加电影信息条目</p>
      <p>2. 【后端】缓存首页电影、电视剧、热映数据</p>
      <p>3. 【前端】电影数据请求超时，提示信息</p>
      <p>4. 【前端】优化数据作用域</p>
      <p>5. 【前端】提高bar颜色自定义功能</p>
      <h3>### 【1.3.1】2021/4/1</h3>
      <p>1. 增加影人详情数据展示</p>
      <p>2. 影片播放地址复制功能</p>
      <p>3. 影片语言、片长信息</p>
      <h3>### 【1.4.0】2021/7/31</h3>
      <p>1. 对影片信息数据缺失的优化显示</p>
      <h3>### 【1.4.1】2021/8/4</h3>
      <p>1. 修复影片导演、演员、编剧显示不完全的BUG</p>
      <p>2. 新增URL的直接播放，在搜索中直接输入网址即可</p>
      <h3>### 【1.4.2】2021/9/19</h3>
      <p>1. 增加评论排序方式，在Setting页面设置</p>
      <p>2. 增加Setting页面修改成功或失败的Snackbars</p>
      <h3>### 【1.5.0】2021/11/14</h3>
      <p>1. 使用ThinkPhp作为后端API的框架</p>
      <p>2. 使用DPlayer播放器代替原先的iframe</p>
      <p>3. 删除路由中播放地址的显示</p>
    </v-card-text>
  </v-card>
</template>

<script>
export default {
  created() {
    document.title = "ABOUT - " + this.GLOBAL.sitename;
    this.$root.bartitle = "ABOUT";
  },
};
</script>

<style scoped>
h3 {
  margin: 0;
  padding: 0;
  line-height: 20px;
}
p {
  margin: 0 auto;
}
</style>
